<font size="6" face="verdana" color="green">
    <img src="Figuras/ICMC_Logo.jpg" width=100>&emsp;&emsp;&emsp;
    <img src="Figuras/Gbdi2005.jpg" width=550><br>
    <b>Introdução à Linguagem SQL</b><br>
    A <b>DDL:</b><i> <b>D</b>ata <b>D</b>efinition <b>L</b>anguage</i><br>
    <u>Parte 2:</u> Os Comandos<br>
    &emsp; &emsp; &emsp; &emsp; &emsp; <font color="blue" font=courier>ALTER TABLE</font> e<br>
    &emsp; &emsp; &emsp; &emsp; &emsp; <font color="blue" font=courier>DROP TABLE</font>
    </font>
<div align="right"><font size="1" face="arial" color="gray">39 cel</font></div>

<br>

**Objetivo:** Explorar comandos básicos da linguagem sub-linguagem de definição de dados em SQL,\
    usando como exemplo de teste uma <i>toy database</i> que contém dados sobre as mátriculas de 15 alunos:\
    &emsp; &emsp; __a base de Dados `Alunos15`__

__Atividades:__ 
 * Explorar o comando `ALTER TABLE`
 * Explorar o comando `CREATE TABLE AS`
 * Restrições definidas por `CHECK`
 * Explorar o comando `DROP TABLE`

<br><br>

----

<br>

## 1. Conectar com a Base de Dados

Para começar, sempre é necessário, em cada `Notebook`:
  * Carregar os pacotes que serão usados;
  * Estabelecer a coneção com a base.

In [ ]:
############## Importar os módulos necessários para o Notebook:
import ipywidgets as widgets     #---
from sqlalchemy import create_engine

from pgspecial.main import PGSpecial           #--- para rodar comandos do psql
from pgspecial.namedqueries import NamedQueries

############## Conectar com um servidor SQL na base Alunos 15 ###################### --> Postgres.Alunos15
%load_ext sql

# Connection format: %sql dialect+driver://username:password@host:port/database
engine = create_engine('postgresql://postgres:pgadmin@localhost/alunos15')
%sql postgresql://postgres:pgadmin@localhost/alunos15

<br><br>

----

<br>

Vamos também "limpar" a base de qualquer tabela que possa ter sido criada em execuções anteriores deste _notebook_:

In [ ]:
%%sql
DROP TABLE IF EXISTS Aluno2 CASCADE;
DROP TABLE IF EXISTS Professor2 CASCADE;
DROP TABLE IF EXISTS Doutores CASCADE;
DROP TABLE IF EXISTS Livre_docs CASCADE;
DROP TABLE IF EXISTS Prof_visitante CASCADE;

<br><br>

----

<br>

## 2. O Comando `ALTER TABLE`

A Sintaxe geral do Comando `ALTER TABLE` visa fazer uma alteração de cada vez:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
ALTER TABLE [IF EXISTS] $<$nome da tabela$>$<br>
   &emsp; &emsp; $<$Mudança$>$ [,$<$mudança$>$...];<br>
</font></b>onde:<br>
<font size="3" color="blue" font=courier><b>$<$Mudança$>$ =</b></font><br>
<font size="3" face="courier" color="blue"><strong>
   &emsp; &emsp; &ensp; ADD [COLUMN] [IF NOT EXISTS] $<$definição de Coluna$>$<br>
   &emsp; &emsp; | ADD $<$Restrição de integridade$>$ -- Chaves primária, Candidatas, Estrangeiras.<br><br>
   &emsp; &emsp; | ALTER [COLUMN] $<$definição de Coluna$>$ [SET DATA] TYPE $<$Tipo$>$<br>
   &emsp; &emsp; | ALTER [COLUMN] $<$definição de Coluna$>$ {SET|DROP} DEFAULT $<$default$>$<br>
   &emsp; &emsp; | ALTER [COLUMN] $<$definição de Coluna$>$ {SET|DROP} NOT NULL<br><br>
   &emsp; &emsp; | DROP [IF EXISTS] $<$definição de Coluna$>$<br>
   &emsp; &emsp; | DROP CONSTRAINT [IF EXISTS] CHECK<br>
   &emsp; &emsp; | DROP CONSTRAINT [IF EXISTS] $<$nome da chave$>$<br>
   &emsp; &emsp; | DROP CONSTRAINT [IF EXISTS] UNIQUE ($<$definição de Coluna$>$, ...)<br>
   &emsp; &emsp; | DROP CONSTRAINT [IF EXISTS] PRIMARY KEY<br>
   &emsp; &emsp; | DROP CONSTRAINT [IF EXISTS] FOREIGN KEY<br><br>
   &emsp; &emsp; | RENAME $<$novo nome$>$    -- Renomeia a tabela<br>
   &emsp; &emsp; | RENAME [COLUMN] $<$Atributo$>$ TO $<$novo atributo$>$<br>
</strong></font></div>

<br>

<font size="3" color="blue" font=courier><b>$<$Definição de coluna$>$</b></font> pode ser:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue">
$<$Nome Atributo$>$ $<$Tipo de Dado$>$ <br>
   &emsp; [<u>NULL</u> | NOT NULL]<br>
   &emsp; {SET | DROP} [NULL] | [DEFAULT $<$Valor$>$]   &emsp;  &emsp; <font color="black"></font>
</font></b></div>

Suponha que existe uma relação de `Professores` com os seguintes atributos:
<div class=”square” style="background-color:#B0B0FF;"><font size="4" face="courier" color="black"><strong>
Professor2={NUSP, Nome, Idade, Nivel}
</strong></div>

In [ ]:
%%sql
DROP TABLE IF EXISTS ProfessorDois;
CREATE TABLE ProfessorDois(
    NUSP Decimal(7),
    Nome Varchar(60),
    Idade Decimal(3),
    Nivel Char(4)     NOT NULL,
      PRIMARY KEY (NUSP),
      UNIQUE (Nome)
    );

INSERT INTO ProfessorDois VALUES(9876, 'Maria', 35, 'MS-3');
INSERT INTO ProfessorDois VALUES(8765, 'Meire', 45, 'MS-5');
SELECT * FROM ProfessorDois;


<br><br>

----

<br><br>
### 2.1. Alterar o nome da tabela

Podemos alterar o nome de uma Tabela, desde que não exista uma tabela com o nome novo usando a sintaxe<br>
<b><font size="3" face="courier" color="blue"> ALTER TABLE $<$Nome_Tabela$>$<br>
&emsp; &emsp; RENAME TO $<$Novo_Nome$>$; </font></b>\

Por exemplo:

In [ ]:
%%sql
DROP TABLE IF EXISTS Professor2;
ALTER TABLE ProfessorDois
    RENAME TO Professor2;


<br><br>

----

<br><br>
### 2.2 Acrescentar um novo atributo à tabela

Podemos acrescentar um novo atributo usando a sintaxe:\
<b><font size="3" face="courier" color="blue"> 
ALTER TABLE $<$Nome_Tabela$>$<br> 
&emsp; &emsp; ADD COLUMN $<$Nome_Atributo$>$ $<$Tipo_de_Dado$>$ $<$Restrição_de_Atributo$>$;
</font></b>

  * Por exemplo, podemos definir o valor _default_ para ser colocado em todas as tuplas
    * que já existem,
    * ou venham a existir:

In [ ]:
%%sql
ALTER TABLE Professor2
    ADD CorCabelos CHAR(10) DEFAULT 'Branco';

INSERT INTO Professor2 VALUES(7650, 'Mara',  36, 'MS-3');
INSERT INTO Professor2 VALUES(7651, 'Maisa', 46, 'MS-5', 'Castanho');

SELECT * FROM Professor2;


<br><br>

----

<br><br>

Podemos acrescentar um novo atributo,
  * e definir que ele pode ficar `Nulo` por  _default_.

In [ ]:
%%sql
ALTER TABLE Professor2
    ADD Altura Decimal(4,2) DEFAULT NULL;

INSERT INTO Professor2 VALUES(7652, 'Marta',  36, 'MS-3', NULL, 1.68);
INSERT INTO Professor2 VALUES(7653, 'Márcia', 46, 'MS-5', 'Loiro', 1.65);


SELECT * FROM Professor2;


<br><br>

----

<br><br>
### 2.3. Remover um atributo da tabela

Podemos remover um atributo usando a sintaxe:<br>
<b><font size="3" face="courier" color="blue"> 
ALTER TABLE $<$Nome_Tabela$>$<br>
 &emsp; &emsp; DROP COLUMN $<$Nome Atributo$>$;
</font></b>

Não queremos mais armazenar a altura!

In [ ]:
%%sql
ALTER TABLE Professor2 DROP Altura;

SELECT * FROM Professor2


<br><br>

----

<br><br>
### 2.4. Renomear um atributo

Podemos alterar o nome de um atributo usando a sintaxe:\
<b><font size="3" face="courier" color="blue">
ALTER TABLE $<$Nome_Tabela$>$<br>
&emsp; &emsp; RENAME COLUMN $<$Nome_Atributo$>$<br>
&emsp; &emsp; TO $<$Novo_Nome_Atributo$>$;

Vamos trocar o nome da cor dos cabelos:

In [ ]:
%%sql
ALTER TABLE Professor2 
    RENAME COLUMN CorCabelos 
           TO Cabelo;

SELECT * FROM Professor2


<br><br>

----

<br><br>

### 2.5. Alterar o tipo de um Atributo

Podemos alterar o tipo de um atributo com a sintaxe:\
<b><font size="3" face="courier" color="blue"> 
ALTER TABLE $<$Nome_Tabela$>$<br>
&emsp; &emsp; ALTER COLUMN $<$Nome_Coluna$>$ <br>
&emsp; &emsp; [SET DATA] TYPE $<$Novo_Tipo$>$<br>
&emsp; &emsp;  [USING expression];<br>
</font></b>

Uma das situações mais comuns é modificar o "_tamanho_" de um atributo, \
tal como a quantidade de caracteres uma cadeia.

Por exemplo, se colocar uma `cor de cabelo` <u>com muitos caracteres</u> <font color="red">dá erro:</font>\
porque não cabe no tamanho previsto do atributo:

In [ ]:
%%sql
INSERT INTO Professor2 VALUES(7654, 'Marilia', 48, 'MS-3', 'Avermelhado');

Então podemos aumentar o tamanho do tipo de dados desse atributo:

In [ ]:
%%sql
ALTER TABLE Professor2
    ALTER COLUMN Cabelo SET DATA TYPE CHAR(15);

INSERT INTO Professor2 VALUES(7654, 'Marilia', 48, 'MS-3', 'Avermelhado');

SELECT * FROM Professor2;

<br> 

Se voltarmos ao tamanho anterior, dados já armazenados que violem o novo tamanho\
<font color="red">passam a dar erro e impedir a correção:</font>

In [ ]:
%%sql
ALTER TABLE Professor2
    ALTER COLUMN Cabelo TYPE CHAR(10);

In [ ]:
%%sql
SELECT * FROM Professor2;

In [ ]:
%sql \d Aluno


<br><br>

----

<br><br>

Para evitar o erro, podemos indicar uma expressão que especifique como re-calcular o novo valor do atribo\
para ficar conforme o novo tipo de dados \
(em geral usando o valor antigo do atributo):

In [ ]:
%%sql
ALTER TABLE Professor2
    ALTER COLUMN Cabelo TYPE CHAR(10)
    USING LEFT(Cabelo, 10);

SELECT * FROM Professor2;

Veja que os valores são truncados na base de dados.\
Se o tamanho anterior for restaurado, os dados continuarão truncados:

In [ ]:
%%sql
ALTER TABLE Professor2
    ALTER COLUMN Cabelo SET DATA TYPE CHAR(15);

INSERT INTO Professor2 VALUES(7655, 'Marisa', 56, 'MS-3', 'Castanho Escuro');

SELECT * FROM Professor2;



<br><br>

----

<br><br>

### 2.6. Alterar o valor _default_ de um atributo

Podemos alterar valor _default_ de um atributo com a sintaxe:<br>
<b><font size="3" face="courier" color="blue">
ALTER TABLE $<$Nome_Tabela$>$ <br>
 &emsp; &emsp; ALTER COLUMN $<$Nome_Atributo$>$ <br>
 &emsp; &emsp; [SET DEFAULT value | DROP DEFAULT];
</font></b>

Quando é indicado <b><font size="3" face="courier" color="blue"> DROP DEFAULT </font></b>
novos valores não indicados assumem <b><font size="3" face="courier" color="blue"> NULL </font></b>.

Por exemplo:<br>
<i>Assumir que todo Professor para o qual seu nível não foi indicado é `MS-3`:

In [ ]:
%%sql
ALTER TABLE Professor2 
    ALTER COLUMN Nivel
    SET DEFAULT 'MS-3';

INSERT INTO Professor2 (Nome, Idade, NUSP) VALUES('Mauro', 40, 7656);

SELECT * FROM Professor2;



<br><br>

----

<br><br>

### 2.7. Alterar a restrição de um atributo poder se `nulo`

Podemos alterar  a restrição de um atributo poder se `nulo` com a sintaxe:<br>
<b><font size="3" face="courier" color="blue">
ALTER TABLE $<$Nome_Tabela$>$ <br>
 &emsp; &emsp; ALTER COLUMN $<$Nome_atributo$>$<br>
 &emsp; &emsp; [SET NOT NULL| DROP NOT NULL];
</font></b>

Por exemplo:<br>
<i>Assumir que todo Professor pode ficar com a idade `nula`:

In [ ]:
%%sql
ALTER TABLE Professor2 
    ALTER COLUMN Idade
    DROP NOT NULL;

INSERT INTO Professor2 (Nome, NUSP) VALUES('Muriel',7657);

SELECT * FROM Professor2;



<br><br>

----

<br><br>

### 2.8. Acrescentar uma restrição de usuário a uma tabela

Podemos acrescentar uma restrição de usuário a uma tabela usando a sintaxe:<br>
<b><font size="3" face="courier" color="blue">
ALTER TABLE $<$Nome_Tabela$>$ <br>
 &emsp; &emsp; ADD CHECK $<$expressão$>$;
</font></b>

Por exemplo:<br>
<i>Assumir que um Professor não pode ter idade superior a 100 anos:</i>

In [ ]:
%%sql
ALTER TABLE Professor2
    ADD CHECK (Nivel IN ('MS-1', 'MS-2', 'MS-3', 'MS-5', 'MS-6'));

<br>

Inserir um `Professor` com um nível diferente desses <font size="3" color="red"> resulta em um erro:</font>

In [ ]:
%%sql
INSERT INTO Professor2 
    VALUES(7857, 'Miguel', 40, 'MS-4');


<br><br>

----

<br><br>

## 2.2. Chave estrangeira

Para definir uma chave estrangeira, é necessário que o atributo referenciado \
tenha sido definido como chave primária na sua relação.

Então, antes de criar a chave estrangeira, vamos assegurar que a tabela referenciada exista:

In [ ]:
%%sql
DROP TABLE IF EXISTS Aluno2;
CREATE TABLE Aluno2(
    NUSP decimal(7)  NOT NULL  PRIMARY KEY,
    Nome varchar(60) NOT NULL  UNIQUE,
    Cidade char(25),
    Idade decimal(3) NOT NULL
    );

INSERT INTO Aluno2 VALUES(1234, 'Jose', 'Araras', 25);
INSERT INTO Aluno2 VALUES(2345, 'João', 'Itu', 25);

SELECT * FROM Aluno2;

Agora podemos criar a restrição de chave estrangeira e carregar dados na base:

In [ ]:
%%sql
ALTER TABLE Professor2
    ADD Orienta DECIMAL(8)
        CONSTRAINT ProfOrientaAluno
            REFERENCES Aluno2 (NUSP)
            ON UPDATE CASCADE
            ON DELETE SET NULL;

INSERT INTO Professor2 VALUES(7660, 'Marina', 50, 'MS-3', 'Moreno', 1234);

SELECT * FROM Professor2;

Veja que a chave estrangeira pode ficar nula, \
mas se tiver valor, este deve corresponder a um valor da chave primária que existe na relação referenciada.

<font color="red">Caso contrário, dá erro</font>:

In [ ]:
%%sql
INSERT INTO Professor2 VALUES(7661, 'Marilda', 56, 'MS-5', 'Acajú escuro', 1231);


<br><br>

----

<br><br>

Restrições de integridade podem ser removidas da mesma maneira que atributos.

In [ ]:
%%sql
ALTER TABLE Professor2 DROP CONSTRAINT ProfOrientaAluno;

SELECT * FROM Professor2;

<font color="red"><b>ATENÇÃO:</b></font>\
Quando uma restrição é removida, os atributos envolvidos permanecem.\
No entanto, a restrição deixa de existir, e portanto é possível inserir dados que não mais estão conforme àquela restrição.

Por exemplo:

In [ ]:
%%sql
INSERT INTO Professor2 VALUES(7661, 'Marilda', 56, 'MS-5', 'Acajú escuro', 1231);

SELECT * FROM Professor2;

<br>

Nesses casos, é interessante avaliar se não é melhor remover o próprio atributo:

In [ ]:
%%sql
ALTER TABLE Professor2 DROP COLUMN Orienta;

SELECT * FROM Professor2;


<br><br>

----

<br><br>

## 3. O Comando `CREATE TABLE AS`

O Comando <font size="2" face="Verdana" color="blue">CREATE TABLE AS</font> copia a estrutura de uma tabela, e pode copiar também os dados.

A sintaxe geral do Comando é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue"><strong>
CREATE TABLE [IF NOT EXISTS]  $<$nome da tabela$>$<br>
   &emsp; &emsp; &emsp; &emsp; [ ($<$column_name$>$[, ...] ) ]<br>
   &emsp; &emsp;  AS ({TABLE $<$Tabela Existente$>$ | $<$consulta$>$ })<br>
   &emsp; &emsp;  [WITH [NO] <u>DATA</u>]
</font></strong></div>


onde o _default_ é copiar `WITH DATA`.

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS Doutores  AS (
    SELECT * 
        FROM Professor2 
        WHERE Nivel='MS-3');

SELECT * FROM Doutores;


<br><br>

----

<br><br>

É possível copiar apenas alguns dos atributos da tabela original, \
ou mesmo "salvar" uma tabela resultante de outras operações, tais como resultados de junções.

A opção <font size="2" face="Verdana" color="blue">[ ($<$column_name$>$[, ...] ) ]</font> permite dar novos nomes aos atributos:

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS Livre_Docs (NumeroUSP, NomeDocente, Idade)  AS (
    SELECT NUSP, Nome, Idade 
        FROM Professor2 
        WHERE Nivel='MS-5');

SELECT * FROM Livre_Docs;

Se quizermos apenas copiar a estrutura da tabela, podemos usar:

In [ ]:
%%sql
CREATE TABLE IF NOT EXISTS Prof_Visitante AS 
    TABLE Professor2
    WITH NO DATA;

SELECT * FROM Prof_Visitante;

<br><br>

----

<br><br>

A tabela criada como cópia inclui
  * todos os atributos,\
    cada um com o nome (possivelmente alterado)\
    e o tipo do atributo original,
  * mas sem nenhuma restrição de integridade.
  * Restrições podem ser acrescentadas posteriormente com o comando
    <font size="2" face="Verdana" color="blue">ALTER TABLE</font>

In [ ]:
%%sql
ALTER TABLE Doutores
    ADD CONSTRAINT NUSP_Pk PRIMARY KEY (NUSP);
ALTER TABLE Doutores
    ADD CONSTRAINT Nome_UN UNIQUE (Nome);
ALTER TABLE Doutores
    ALTER COLUMN Nome SET NOT NULL,
    ALTER COLUMN Nome SET NOT NULL;


<br><br>

----

<br><br>

## 4. A Cláusula `CHECK`

Restrições que não estão previstas como Fundamentais do Modelo Relacional, podem ser indicadas pela cláusula
<b><font size="2" face="Verdana" color="blue">CHECK ( expression )</font></b>.

Por exemplo, para indicar que a idade de um `Aluno` deve ser maior do que 10 anos e no máximo 120 anos, podemos indicar":

In [ ]:
%%sql
ALTER TABLE Professor2
    ADD CONSTRAINT IdadeATE150 CHECK (Idade >10 AND Idade <= 120);

Para indicar que o nível de um `Professor` tem que ser `MS-1`, 2, 3, 5 ou 6, \
podemos indicar:

In [ ]:
%%sql
ALTER TABLE Professor2
    ADD CONSTRAINT ValidaNivel CHECK (Nivel IN ('MS-1', 'MS-2', 'MS-3', 'MS-5', 'MS-6'));

Quando a Restrição é violada, <font color="red"> dá erro</font>:

In [ ]:
%%sql
INSERT INTO Professor2 VALUES(7661, 'Mônica', 66, 'MS-X');


<br><br>

----

<br><br>

## 5. O comando `DROP TABLE`

O Comando `DROP TABLE` elimina um tipo de dado já definido pelo usuário.
Sua sintaxe é:
<div class=”square” style="background-color:#EAF0F0;"><b><font size="3" face="courier" color="blue"><strong>
DROP DOMAIN [IF EXISTS] $<$Nome do Domínio$>$[, ...]<br>
   &emsp; &emsp; &emsp; &emsp; [CASCADE | <u>RESTRICT</u>]
</font></strong></div>

  * <font size="2" face="Verdana" color="blue">CASCADE:</font> Todas as visões e restrições (_constraints_) que referenciam o atributo são removidas automaticamente.
  * <font size="2" face="Verdana" color="blue">RESTRICT:</font> RESTRICT}: O atributo só é removido se não houver nenhuma visão ou restrição que o referencie.


Por exemplo:

In [ ]:
%%sql
DROP TABLE Doutores;

Veja que <font color="red">a tabela e a sua definição são apagadas!!!</font>

In [ ]:
%%sql
SELECT * FROM Doutores;


<br><br>

----

<br><br>

Se houver alguma dependência dessa tabela, <font color="red">o comando pode falhar</font>:

Por exemplo, suponha que a relação de `Professores` tenha uma chave estrangeira em `Alunos`:

In [ ]:
%%sql
ALTER TABLE Professor2
    ADD Orienta DECIMAL(8)
        REFERENCES Aluno2 (NUSP)
        ON UPDATE CASCADE
        ON DELETE SET NULL;

INSERT INTO Professor2 VALUES(7666, 'Marisa', 53, 'MS-6', 'Moreno', 1234);

SELECT * FROM Professor2;

Com essa dependência, <font color="red">a relação de Alunos não pode ser removida...</font>

In [ ]:
%%sql
DROP TABLE Aluno2;

Isso pode ser resolvido removendo a dependência primeiro \
(com um comando `ALTER TABLE Professor2 DROP Orienta;`),\
ou executando o comando `DROP TABLE` com a opção `CASCADE`\
(veja que nesse caso, todas as dependências são apagadas):

In [ ]:
%%sql
DROP TABLE Aluno2 CASCADE;

Veja que é apagada a dependência da chave estrangeira, mas a tabela original (`Professor`) permanece, \
inclusive com o atributo que antes era, mas que agora deixa de ser chave estrangeira:

In [ ]:
%%sql
SELECT * FROM Professor2;

INSERT INTO Professor2 VALUES(7662, 'Mônica', 57, 'MS-5', 'Loiro claro', 1234321);

SELECT * FROM Professor2;

<br><br>

----

<br><br>

<font size="4" color="blue" font=Verdana><b>Conclusão</b></font>

Objetos de tipo `Table` podem ser criados, modificados e removidos com os comandos<br>
    &emsp; &emsp; <font color="blue" font=courier>CREATE TABLE</font>,<br>
    &emsp; &emsp; <font color="blue" font=courier>ALTER TABLE</font> e<br>
    &emsp; &emsp; <font color="blue" font=courier>DROP TABLE</font>

  * Cada comando opera sobre exatamente uma tabela

  * O comando `ALTER TABLE` pode fazer uma ou mais alterações sobre a tabela\
    &emsp; cada alteração deve ser completamente descrita,\
    &emsp; as alterações devem ser separadas por vírgula.
  * Restrições `CHECK` devem envolver apenas atributos da própria tabela

  * O comando `DROP TABLE` remove a tabela e a definição da tabela.\
    &emsp; Dependencias dessa tabela devem ser removidas primeiro\
    &emsp; &emsp; ou pode ser usada a opção `CASCADE`.

<br><br>

----

<br><br>

Vamos finalizar o _notebook_ apagando os objetos que foram criados apenas para exemplos:

In [ ]:
%%sql
DROP TABLE IF EXISTS Aluno2 CASCADE;
DROP TABLE IF EXISTS Professor2 CASCADE;
DROP TABLE IF EXISTS Doutores CASCADE;
DROP TABLE IF EXISTS Livre_docs CASCADE;
DROP TABLE IF EXISTS Prof_visitante CASCADE;


<br><br>

----

<br><br>

<font size="6" face="verdana" color="green">
    <b>Introdução à Linguagem SQL</b><br>
    A <b>DDL:</b><i> <b>D</b>ata <b>D</b>efinition <b>L</b>anguage</i><br>
    <u>Parte 2:</u> Os Comandos <font color="blue" font=courier>ALTER</font> e 
                                <font color="blue" font=courier>DROP TABLE</font>
    </font><br><br>

<img src="Figuras/ICMC_Logo.jpg" width=80>&emsp;
<font size="10" face="verdana" color="red"><b>FIM</b>&nbsp;&nbsp;&nbsp;&nbsp;</font>
<img src="Figuras/Gbdi2005.jpg" width=400>